# Создаем переменную name и присваиваем ей значение
name = "Алексей"  # Имя Алексей
# Создаем переменную age и присваиваем ей значение
age = 26  # Возраст 26
# Выводим исходное значение переменной age на экран
print(f"Name: {name}")
print(f"Age: {age}")
# Перезаписываем переменную age с добавлением нового значения
age += 1  # Увеличиваем age на 1
# Выводим новое значение переменной age на экран
print(f"New Age: {age}")
# Создаем переменную is_student и присваиваем ей значение True
is_student = True
# Выводим значение переменной is_student на экран
print(f"Is Student: {is_student}")